Repository: zizicici/Pin-It
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: ar, de, es, es_419, fr, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans, zh_hk

# style.add
source: New Style
ar: نمط جديد
de: Neuer Stil
es: Nuevo estilo
es_419: Nuevo estilo
fr: Nouveau style
it: Nuovo stile
ja: 新規スタイル
ko: 새 스타일
pt_br: Novo estilo
pt_pt: Novo estilo
ru: Новый стиль
uk: Новий стиль
zh_hans: 增加样式
zh_hk: 新增樣式

# style.alert.angle.message
source: Recommended range: -360 to 360.
ar: النطاق الموصى به: -360 إلى 360.
de: Empfohlener Bereich: -360 bis 360.
es: Rango recomendado: -360 a 360.
es_419: Rango recomendado: -360 a 360.
fr: Plage recommandée : -360 à 360.
it: Intervallo consigliato: da -360 a 360.
ja: 推奨範囲：-360から360まで
ko: 권장 범위: -360에서 360까지
pt_br: Faixa recomendada: -360 a 360.
pt_pt: Intervalo recomendado: -360 a 360.
ru: Рекомендуемый диапазон: от -360 до 360.
uk: Рекомендований діапазон: від -360 до 360.
zh_hans: 建议输入在-360到360之间
zh_hk: 建議輸入在-360到360之間

# style.alert.angle.title
source: Please Input Number
ar: يرجى إدخال رقم
de: Bitte Zahl eingeben
es: Por favor ingrese un número
es_419: Por favor ingrese un número
fr: Veuillez saisir un nombre
it: Inserisci un numero
ja: 数字を入力してください
ko: 숫자를 입력해 주세요
pt_br: Por favor, insira um número
pt_pt: Por favor, insira um número
ru: Пожалуйста, введите число
uk: Будь ласка, введіть число
zh_hans: 请输入数字
zh_hk: 請輸入數字

# style.alert.delete.title
source: Delete This Style?
ar: حذف هذا النمط؟
de: Diesen Stil löschen?
es: ¿Eliminar este estilo?
es_419: ¿Eliminar este estilo?
fr: Supprimer ce style ?
it: Eliminare questo stile?
ja: このスタイルを削除しますか？
ko: 이 스타일을 삭제하시겠습니까?
pt_br: Excluir este estilo?
pt_pt: Eliminar este estilo?
ru: Удалить этот стиль?
uk: Видалити цей стиль?
zh_hans: 删除这个样式吗？
zh_hk: 刪除這個樣式嗎？

# style.default
source: Default Style
ar: النمط الافتراضي
de: Standardstil
es: Estilo predeterminado
es_419: Estilo predeterminado
fr: Style par défaut
it: Stile predefinito
ja: デフォルトスタイル
ko: 기본 스타일
pt_br: Estilo padrão
pt_pt: Estilo predefinido
ru: Стиль по умолчанию
uk: Стиль за замовчуванням
zh_hans: 默认样式
zh_hk: 默認樣式

# style.default%@
source: Default (%@)
ar: افتراضي (%@)
de: Standard (%@)
es: Predeterminado (%@)
es_419: Predeterminado (%@)
fr: Par défaut (%@)
it: Predefinito (%@)
ja: デフォルト (%@)
ko: 기본 (%@)
pt_br: Padrão (%@)
pt_pt: Predefinido (%@)
ru: По умолчанию (%@)
uk: За замовчуванням (%@)
zh_hans: 默认（%@）
zh_hk: 默認（%@）

# style.editor
source: Edit Style
ar: تحرير النمط
de: Stil bearbeiten
es: Editar estilo
es_419: Editar estilo
fr: Modifier le style
it: Modifica stile
ja: スタイルを編集
ko: 스타일 편집
pt_br: Editar estilo
pt_pt: Editar estilo
ru: Редактировать стиль
uk: Редагувати стиль
zh_hans: 编辑样式
zh_hk: 編輯樣式

# style.imageDisplayMode
source: Image Display Mode
ar: وضع عرض الصورة
de: Bildanzeigemodus
es: Modo de visualización de imagen
es_419: Modo de visualización de imagen
fr: Mode d'affichage d'image
it: Modalità visualizzazione immagine
ja: 画像表示モード
ko: 이미지 표시 모드
pt_br: Modo de exibição de imagem
pt_pt: Modo de exibição de imagem
ru: Режим отображения изображения
uk: Режим відображення зображення
zh_hans: 图片显示模式
zh_hk: 圖片顯示模式

# style.imageDisplayMode.aspectFill
source: Aspect Fill
ar: ملء النسبة
de: Seitenverhältnis füllen
es: Rellenar proporción
es_419: Rellenar proporción
fr: Remplir proportionnellement
it: Riempimento proporzionale
ja: アスペクトフィル
ko: 비율 채우기
pt_br: Preencher proporção
pt_pt: Preencher proporção
ru: Заполнение с сохранением пропорций
uk: Заповнення зі збереженням пропорцій
zh_hans: 放大填充
zh_hk: 放大填充

# style.imageDisplayMode.aspectFit
source: Aspect Fit
ar: ملاءمة النسبة
de: Seitenverhältnis anpassen
es: Ajustar proporción
es_419: Ajustar proporción
fr: Ajuster proportionnellement
it: Adatta proporzionalmente
ja: アスペクトフィット
ko: 비율 맞추기
pt_br: Ajustar proporção
pt_pt: Ajustar proporção
ru: Вписать с сохранением пропорций
uk: Вписати зі збереженням пропорцій
zh_hans: 完整显示
zh_hk: 完整顯示

# style.island
source: Dynamic Island
ar: الديناميكية آيلاند
es: Isla Dinámica
es_419: Isla Dinámica
fr: Île dynamique
it: Isola Dinamica
ja: ダイナミックアイランド
ko: 다이내믹 아일랜드
pt_br: Ilha Dinâmica
pt_pt: Ilha Dinâmica
ru: Динамический остров
uk: Динамічний острів
zh_hans: 灵动岛
zh_hk: 動態島

# style.islandTextColor
source: Text Color
ar: لون النص
de: Textfarbe
es: Color del texto
es_419: Color del texto
fr: Couleur du texte
it: Colore testo
ja: 文字色
ko: 텍스트 색상
pt_br: Cor do texto
pt_pt: Cor do texto
ru: Цвет текста
uk: Колір тексту
zh_hans: 文字颜色
zh_hk: 文字顏色

source: Style List
ar: قائمة الأنماط
de: Stilliste
es: Lista de estilos
es_419: Lista de estilos
fr: Liste de styles
it: Elenco stili
ja: スタイルリスト
ko: 스타일 목록
pt_br: Lista de estilos
pt_pt: Lista de estilos
ru: Список стилей
uk: Список стилів
zh_hans: 样式列表
zh_hk: 樣式列表

# style.lockBackgroundColor
source: Background Color
ar: لون الخلفية
de: Hintergrundfarbe
es: Color de fondo
es_419: Color de fondo
fr: Couleur d'arrière-plan
it: Colore sfondo
ja: 背景色
ko: 배경 색상
pt_br: Cor de fundo
pt_pt: Cor de fundo
ru: Цвет фона
uk: Колір фону
zh_hans: 背景颜色
zh_hk: 背景顏色

# style.lockScreen
source: Lock Screen
ar: شاشة القفل
de: Sperrbildschirm
es: Pantalla de bloqueo
es_419: Pantalla de bloqueo
fr: Écran verrouillé
it: Schermata di blocco
ja: ロック画面
ko: 잠금 화면
pt_br: Tela de bloqueio
pt_pt: Ecrã de bloqueio
ru: Экран блокировки
uk: Екран блокування
zh_hans: 锁屏页面
zh_hk: 鎖定畫面

# style.lockTextColor
source: Text Color
ar: لون النص
de: Textfarbe
es: Color del texto
es_419: Color del texto
fr: Couleur du texte
it: Colore testo
ja: 文字色
ko: 텍스트 색상
pt_br: Cor do texto
pt_pt: Cor do texto
ru: Цвет текста
uk: Колір тексту
zh_hans: 文字颜色
zh_hk: 文字顏色

source: Style Name
ar: اسم النمط
de: Stilname
es: Nombre del estilo
es_419: Nombre del estilo
fr: Nom du style
it: Nome stile
ja: スタイル名
ko: 스타일 이름
pt_br: Nome do estilo
pt_pt: Nome do estilo
ru: Название стиля
uk: Назва стилю
zh_hans: 样式名称
zh_hk: 樣式名稱

# style.others
source: Others
ar: أخرى
de: Andere
es: Otros
es_419: Otros
fr: Autres
it: Altri
ja: その他
ko: 기타
pt_br: Outros
pt_pt: Outros
ru: Другие
uk: Інші
zh_hans: 其他
zh_hk: 其他

# style.placeholder
source: New Style
ar: نمط جديد
de: Neuer Stil
es: Nuevo estilo
es_419: Nuevo estilo
fr: Nouveau style
it: Nuovo stile
ja: 新規スタイル
ko: 새 스타일
pt_br: Novo estilo
pt_pt: Novo estilo
ru: Новый стиль
uk: Новий стиль
zh_hans: 新建样式
zh_hk: 新建樣式

# style.postControlDisplayMode
source: Button Display Mode
ar: وضع عرض الأزرار
de: Schaltflächenanzeigemodus
es: Modo de visualización de botones
es_419: Modo de visualización de botones
fr: Mode d'affichage des boutons
it: Modalità visualizzazione pulsanti
ja: ボタン表示モード
ko: 버튼 표시 모드
pt_br: Modo de exibição de botões
pt_pt: Modo de exibição de botões
ru: Режим отображения кнопок
uk: Режим відображення кнопок
zh_hans: 按钮显示模式
zh_hk: 按鈕顯示模式

# style.postControlDisplayMode.normal
source: Normal
ar: عرض
de: Anzeigen
es: Mostrar
es_419: Mostrar
fr: Afficher
it: Mostra
ja: 表示
ko: 표시
pt_br: Exibir
pt_pt: Exibir
ru: Показать
uk: Показати
zh_hans: 显示
zh_hk: 顯示

# style.postControlDisplayMode.transparent
source: Transparent
ar: شفافية
es: Transparente
es_419: Transparente
it: Trasparente
ja: 透明化
ko: 투명화
pt_br: Transparente
pt_pt: Transparente
ru: Прозрачный
uk: Прозорий
zh_hans: 透明化
zh_hk: 透明化

# style.postControlDisplayMode.transparent.hint
source: The buttons remain active, and the content area will be maximized.
ar: تبقى الأزرار نشطة، وسيتم توسيع منطقة المحتوى إلى أقصى حد.
de: Die Schaltflächen bleiben aktiv und der Inhaltsbereich wird maximiert.
es: Los botones permanecen activos y el área de contenido se maximizará.
es_419: Los botones permanecen activos y el área de contenido se maximizará.
fr: Les boutons restent actifs et la zone de contenu sera maximisée.
it: I pulsanti rimangono attivi e l'area del contenuto sarà massimizzata.
ja: ボタンは引き続き有効で、コンテンツ表示領域が最大化されます。
ko: 버튼은 여전히 유효하며 콘텐츠 표시 영역이 최대화됩니다.
pt_br: Os botões permanecem ativos e a área de conteúdo será maximizada.
pt_pt: Os botões permanecem ativos e a área de conteúdo será maximizada.
ru: Кнопки остаются активными, а область содержимого будет увеличена.
uk: Кнопки залишаються активними, а область вмісту буде максимізована.
zh_hans: 按钮依旧有效，内容显示区域将最大化
zh_hk: 按鈕依舊有效，內容顯示區域將最大化

# style.symbol
source: Symbol
ar: رمز
es: Símbolo
es_419: Símbolo
fr: Symbole
it: Simbolo
ja: シンボル
ko: 심볼
pt_br: Símbolo
pt_pt: Símbolo
ru: Символ
uk: Символ
zh_hans: 标志
zh_hk: 標誌

# style.symbol.angle
source: Angle of Rotation
ar: زاوية الدوران
de: Drehwinkel
es: Ángulo de rotación
es_419: Ángulo de rotación
fr: Angle de rotation
it: Angolo di rotazione
ja: 回転角度
ko: 회전 각도
pt_br: Ângulo de rotação
pt_pt: Ângulo de rotação
ru: Угол поворота
uk: Кут повороту
zh_hans: 旋转角度
zh_hk: 旋轉角度

# style.symbolColor
source: Color
ar: لون
de: Farbe
fr: Couleur
it: Colore
ja: 色
ko: 색상
pt_br: Cor
pt_pt: Cor
ru: Цвет
uk: Колір
zh_hans: 颜色
zh_hk: 顏色

# style.textAlignment
source: Multi-line Text Alignment
ar: محاذاة النص متعدد الأسطر
de: Mehrzeilige Textausrichtung
es: Alineación de texto multilínea
es_419: Alineación de texto multilínea
fr: Alignement de texte multiligne
it: Allineamento testo multilinea
ja: 複数行テキストの配置
ko: 다중 줄 텍스트 정렬
pt_br: Alinhamento de texto multilinha
pt_pt: Alinhamento de texto multilinha
ru: Выравнивание многострочного текста
uk: Вирівнювання багаторядкового тексту
zh_hans: 文本行对齐方式
zh_hk: 文本行對齊方式

# style.textAlignment.center
source: Center
ar: محاذاة إلى الوسط
de: Zentriert
es: Centrar
es_419: Centrar
fr: Centrer
it: Centra
ja: 中央揃え
ko: 가운데 정렬
pt_br: Centralizar
pt_pt: Centralizar
ru: По центру
uk: По центру
zh_hans: 居中对齐
zh_hk: 置中對齊

# style.textAlignment.leading
source: Leading
ar: محاذاة إلى البداية
de: Linksbündig
es: Alinear a la izquierda
es_419: Alinear a la izquierda
fr: Aligner à gauche
it: Allinea a sinistra
ja: 左揃え
ko: 왼쪽 정렬
pt_br: Alinhar à esquerda
pt_pt: Alinhar à esquerda
ru: По левому краю
uk: По лівому краю
zh_hans: 行首对齐
zh_hk: 行首對齊

# style.textAlignment.trailing
source: Trailing
ar: محاذاة إلى النهاية
de: Rechtsbündig
es: Alinear a la derecha
es_419: Alinear a la derecha
fr: Aligner à droite
it: Allinea a destra
ja: 右揃え
ko: 오른쪽 정렬
pt_br: Alinhar à direita
pt_pt: Alinhar à direita
ru: По правому краю
uk: По правому краю
zh_hans: 行尾对齐
zh_hk: 行尾對齊

# style.textSize
source: Text Size
ar: حجم النص
de: Textgröße
es: Tamaño de texto
es_419: Tamaño de texto
fr: Taille du texte
it: Dimensione testo
ja: 文字サイズ
ko: 텍스트 크기
pt_br: Tamanho do texto
pt_pt: Tamanho do texto
ru: Размер текста
uk: Розмір тексту
zh_hans: 字号大小
zh_hk: 字型大小

# style.textSize.auto
source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
es_419: Automático
fr: Automatique
it: Automatico
ja: 自動
ko: 자동
pt_br: Automático
pt_pt: Automático
ru: Автоматически
uk: Автоматично
zh_hans: 自动
zh_hk: 自動

# style.title
source: Style
ar: النمط
de: Stil
es: Estilo
es_419: Estilo
it: Stile
ja: スタイル
ko: 스타일
pt_br: Estilo
pt_pt: Estilo
ru: Стиль
uk: Стиль
zh_hans: 样式
zh_hk: 樣式

# thanks.alert.message
source: This will delete the banner forever. You cannot undo this action.
ar: سيحذف هذا اللافتة إلى الأبد، لا يمكن التراجع عن هذا الإجراء
de: Dies wird das Banner endgültig löschen. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto eliminará el banner para siempre. No podrás deshacer esta acción.
es_419: Esto eliminará el banner para siempre. No podrás deshacer esta acción.
fr: Cela supprimera définitivement la bannière. Vous ne pourrez pas annuler cette action.
it: Questo eliminerà il banner per sempre. Non potrai annullare questa azione.
ja: このバナーを完全に削除します。この操作は元に戻せません。
ko: 이렇게 하면 배너가 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다.
pt_br: Isso excluirá o banner para sempre. Você não pode desfazer esta ação.
pt_pt: Isto irá eliminar o banner para sempre. Não pode anular esta ação.
ru: Это навсегда удалит баннер. Вы не сможете отменить это действие.
uk: Це назавди видалить банер. Ви не зможете скасувати цю дію.
zh_hans: 你将永久性地删除感谢栏，这个操作不能回退。
zh_hk: 你將永久性地刪除感謝欄，這個操作不能回退。

# thanks.alert.title
source: Delete Thanks Banner
ar: حذف لافتة الشكر
de: Dankesbanner löschen
es: Eliminar banner de agradecimiento
es_419: Eliminar banner de agradecimiento
fr: Supprimer la bannière de remerciement
it: Elimina banner di ringraziamento
ja: 感謝バナーを削除
ko: 감사 배너 삭제
pt_br: Excluir banner de agradecimento
pt_pt: Eliminar banner de agradecimento
ru: Удалить баннер благодарности
uk: Видалити банер подяки
zh_hans: 删除感谢栏
zh_hk: 刪除感謝欄

# tips.addPost.message
source: You can add Text or Image.
ar: يمكنك إضافة نص أو صورة
de: Text oder Bild hinzufügen
es: Puedes añadir texto o imagen
es_419: Puedes agregar texto o imagen
fr: Ajouter du texte ou une image
it: Puoi aggiungere testo o immagini
ja: テキストまたは画像を追加できます
ko: 텍스트 또는 이미지 추가
pt_br: Você pode adicionar texto ou imagem
pt_pt: Pode adicionar texto ou imagem
ru: Можно добавить текст или изображение
uk: Можна додати текст чи зображення
zh_hans: 你能添加文字或者图片
zh_hk: 你能添加文字或者圖片

# tips.addPost.title
source: Tap Button to Add Post
ar: انقر على الزر لإضافة منشور
de: Tippen zum Hinzufügen
es: Toca para añadir publicación
es_419: Toca para agregar publicación
fr: Toucher pour ajouter
it: Tocca per aggiungere
ja: タップして追加
ko: 탭하여 추가
pt_br: Toque para adicionar
pt_pt: Toque para adicionar
ru: Нажмите, чтобы добавить
uk: Торкніться, щоб додати
zh_hans: 点击按钮添加记录
zh_hk: 點擊按鈕添加記錄

# widget.start.description
source: Show Pin It Live Activity only when there are pinned posts.
ar: اعرض النشاط المباشر لـ Pin It فقط عندما توجد منشورات مثبتة
de: Zeige Pin It Live Activity nur bei angehefteten Beiträgen.
es: Mostrar Pin It Live Activity solo con publicaciones fijadas.
es_419: Mostrar Pin It Live Activity solo con publicaciones fijadas.
fr: Afficher Pin It Live Activity uniquement avec des publications épinglées.
it: Mostra Pin It Live Activity solo con post fissati.
ja: ピン留めされた投稿がある場合のみピンイットライブアクティビティを表示
ko: 고정된 기록이 있을 때만 핀잇 라이브 액티비티 표시
pt_br: Mostrar Pin It Live Activity apenas com registros fixados.
pt_pt: Mostrar Pin It Live Activity apenas com registos fixados.
ru: Показывать Pin It Live Activity только при наличии закреплённых записей.
uk: Показувати Pin It Live Activity лише за наявності закріплених записів.
zh_hans: 显示钉一下实时活动，前提条件是有钉住的记录。
zh_hk: 顯示釘一下即時動態，前提條件是有釘住的記錄。

# widget.start.name
source: Start Button of Pin It
ar: زر بدء Pin It
de: Startknopf von Pin It
es: Botón de inicio de Pin It
es_419: Botón de inicio de Pin It
fr: Bouton de démarrage de Pin It
it: Pulsante di avvio di Pin It
ja: ピンイットの起動ボタン
ko: 핀잇 시작 버튼
pt_br: Botão de iniciar do Pin It
pt_pt: Botão de iniciar do Pin It
ru: Кнопка запуска Pin It
uk: Кнопка запуску Pin It
zh_hans: 钉一下的启动按钮
zh_hk: 釘一下的啓動按鈕

# shortcuts.copy.url
source: https://www.icloud.com/shortcuts/bfd48e81ff1a47dbb57ceeb90f2b2e4a
zh_hans: https://www.icloud.com/shortcuts/37558fc727ff4d6791ca16f1a4e109a9
zh_hk: https://www.icloud.com/shortcuts/37558fc727ff4d6791ca16f1a4e109a9

# shortcuts.pasteboard.url
source: https://www.icloud.com/shortcuts/a1e5a45ae7a64769801c08a2a885806b
zh_hans: https://www.icloud.com/shortcuts/707071f0908741c0b01a011e3dad90eb
zh_hk: https://www.icloud.com/shortcuts/707071f0908741c0b01a011e3dad90eb

# shortcuts.1.url
source: https://www.icloud.com/shortcuts/3ddf28819e144f07b9294784782e42fc
zh_hans: https://www.icloud.com/shortcuts/c48f9c84312e4745ab1c32cbd0cb52c4

# shortcuts.2.url
source: https://www.icloud.com/shortcuts/c6e8da1f7a834b4a8b9b60e19268715f
zh_hans: https://www.icloud.com/shortcuts/dbe885364c354ac9a70261a09b772616
